// js/dungeon/bp03 — طبقه‌ی دست‌ساز: پل خندق
// # دیوار | . کف | S اسپاون | > پله | C صندوق | H محراب | T مشعل | P ستون | W آب | D دکور | R فرش | E دشمن
export const BP03 = {
  name: 'پل خندق',
  rows: [
    '##############################',
    '#S....WWWW......WWWW....WWWW.#',
    '#.....WWWW......WWWW....WWWW.#',
    '#.....WWWW....H.WWWW....WWWW.#',
    '#............................#',
    'T.........C..................T',
    '#..C...E......E.......E......#',
    '#........P..P......P..P......#',
    '#............................#',
    '#WWWWWWWWW..WWWWWWWW..WWWWWWW#',
    '#WWWWWWWWW..WWWWWWWW..WWWWWWW#',
    '#WWWWWWWWW..WWWWWWWW..WWWWWWW#',
    '#........P..P......P..P......#',
    '#....D...............C.......#',
    'T......E..............E...C..T',
    '#............................#',
    '#.....WWWW....D.WWWW....WWWW.#',
    '#.....WWWW......WWWW....WWWW.#',
    '#.....WWWW......WWWW....WWWW>#',
    '##############################',
  ],
};
